<?php
require_once __DIR__ . '/api/tools.php';
// Получаем order_id из URL
error_reporting(E_ALL);
ini_set('display_errors', 1);
$order_id = isset($_GET['order_id']) ? $_GET['order_id'] : '';


if (empty($order_id) || !is_numeric($order_id)) {

    header('Location: /');
    exit;
}



$order_data = get_order($order_id);

$currency_from = get_currency_full($order_data['currency_from']);
$currency_to = get_currency_full($order_data['currency_to']);
?>

<html lang="ru">

<head>
    <meta charset="utf-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no" />
    <link rel="icon" href="/favicon.png" />
    <title>Сделка</title>

    <link href="/css/app.f62af7d1.css?v=<?= time() ?>" rel="stylesheet" />

    <link rel="stylesheet" type="text/css" href="/css/845.253fa153.css" />

</head>

<body cz-shortcut-listen="true">
    <noscript>
        <strong>We're sorry but AsteriChain doesn't work properly without JavaScript
            enabled. Please enable it to continue.</strong>
    </noscript>
    <div id="app" data-v-app="">

        <div class="overlay"></div>
        <header class="header">
            <div class="header__mob-info">Рабочее время: 10:00 - 22:00 GMT+3</div>
            <div class="wrap">
                <div class="header__box">
                    <div onclick="toggleBurger()" class="header__burger"><svg width="20px" height="20px" class="icon" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon">
                            <path opacity="0.5" d="M1 2H19M13.2727 9H1M1 16H19" stroke="#2E4057" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                        </svg></div><a href="/" class="header__logo">

<svg class="icon-logo" xmlns="http://www.w3.org/2000/svg" width="173" height="29" viewBox="0 0 173 29" fill="none">
<path d="M7.64489 28H0.84375L9.67756 1.81818H18.1023L26.9361 28H20.1349L13.9858 8.41477H13.7812L7.64489 28ZM6.73722 17.696H20.9531V22.5028H6.73722V17.696Z" fill="#FF7734"/><path d="M46.3008 14.3594L40.5607 14.5128C40.5011 14.1037 40.3391 13.7415 40.0749 13.4261C39.8107 13.1023 39.4656 12.8509 39.0394 12.6719C38.6218 12.4844 38.136 12.3906 37.582 12.3906C36.8576 12.3906 36.2397 12.5355 35.7283 12.8253C35.2255 13.1151 34.9783 13.5071 34.9869 14.0014C34.9783 14.3849 35.1317 14.7173 35.4471 14.9986C35.771 15.2798 36.3462 15.5057 37.1729 15.6761L40.957 16.392C42.9173 16.767 44.3746 17.3892 45.3292 18.2585C46.2923 19.1278 46.7781 20.2784 46.7866 21.7102C46.7781 23.0568 46.3775 24.2287 45.5849 25.2259C44.8008 26.223 43.7269 26.9986 42.3633 27.5526C40.9996 28.098 39.44 28.3707 37.6843 28.3707C34.8803 28.3707 32.6687 27.7955 31.0494 26.6449C29.4386 25.4858 28.5181 23.9347 28.288 21.9915L34.4627 21.8381C34.5991 22.554 34.9528 23.0994 35.5238 23.4744C36.0948 23.8494 36.8235 24.0369 37.7099 24.0369C38.511 24.0369 39.163 23.8878 39.6658 23.5895C40.1687 23.2912 40.4244 22.8949 40.4329 22.4006C40.4244 21.9574 40.2283 21.6037 39.8448 21.3395C39.4613 21.0668 38.8604 20.8537 38.0423 20.7003L34.6161 20.0483C32.6474 19.6903 31.1815 19.0298 30.2184 18.0668C29.2553 17.0952 28.7781 15.8594 28.7866 14.3594C28.7781 13.0469 29.1275 11.9261 29.8349 10.9972C30.5423 10.0597 31.5479 9.34375 32.8519 8.84943C34.1559 8.35511 35.6942 8.10795 37.467 8.10795C40.1261 8.10795 42.2227 8.66619 43.7567 9.78267C45.2908 10.8906 46.1389 12.4162 46.3008 14.3594ZM60.9482 8.36364V12.9659H48.5604V8.36364H60.9482ZM51.1555 3.65909H57.407V21.8253C57.407 22.2088 57.4666 22.5199 57.5859 22.7585C57.7138 22.9886 57.897 23.1548 58.1357 23.2571C58.3743 23.3509 58.6598 23.3977 58.9922 23.3977C59.2308 23.3977 59.4822 23.3764 59.7464 23.3338C60.0192 23.2827 60.2237 23.2401 60.3601 23.206L61.3061 27.7188C61.0078 27.804 60.5859 27.9105 60.0405 28.0384C59.5036 28.1662 58.8601 28.2472 58.1101 28.2812C56.6442 28.3494 55.3871 28.179 54.3388 27.7699C53.299 27.3523 52.5021 26.7045 51.9482 25.8267C51.4027 24.9489 51.1385 23.8452 51.1555 22.5156V3.65909ZM73.1058 28.3707C71.0518 28.3707 69.2791 27.9659 67.7876 27.1562C66.3047 26.3381 65.1626 25.1747 64.3615 23.6662C63.5689 22.1491 63.1726 20.3466 63.1726 18.2585C63.1726 16.2301 63.5732 14.4574 64.3743 12.9403C65.1754 11.4148 66.3047 10.2301 67.7621 9.38636C69.2195 8.53409 70.9368 8.10795 72.9141 8.10795C74.3118 8.10795 75.5902 8.32528 76.7493 8.75994C77.9084 9.1946 78.9098 9.83807 79.7536 10.6903C80.5973 11.5426 81.2536 12.5952 81.7223 13.848C82.1911 15.0923 82.4254 16.5199 82.4254 18.1307V19.6903H65.3587V16.0597H76.6087C76.6001 15.3949 76.4425 14.8026 76.1357 14.2827C75.8288 13.7628 75.407 13.358 74.87 13.0682C74.3416 12.7699 73.7322 12.6207 73.0419 12.6207C72.343 12.6207 71.7166 12.7784 71.1626 13.0938C70.6087 13.4006 70.1697 13.8224 69.8459 14.3594C69.522 14.8878 69.3516 15.4886 69.3345 16.1619V19.8565C69.3345 20.6577 69.4922 21.3608 69.8075 21.9659C70.1229 22.5625 70.5703 23.027 71.1499 23.3594C71.7294 23.6918 72.4197 23.858 73.2209 23.858C73.7749 23.858 74.2777 23.7812 74.7294 23.6278C75.1811 23.4744 75.5689 23.2486 75.8928 22.9503C76.2166 22.652 76.4595 22.2855 76.6214 21.8509L82.3615 22.017C82.1229 23.304 81.5987 24.4247 80.7891 25.3793C79.9879 26.3253 78.9354 27.0625 77.6314 27.5909C76.3274 28.1108 74.8189 28.3707 73.1058 28.3707ZM85.6183 28V8.36364H91.6907V11.9432H91.8952C92.2532 10.6477 92.837 9.68466 93.6467 9.05398C94.4563 8.41477 95.3981 8.09517 96.4719 8.09517C96.7617 8.09517 97.06 8.11648 97.3668 8.15909C97.6737 8.19318 97.9592 8.24858 98.2234 8.32528V13.7585C97.9251 13.6562 97.533 13.5753 97.0472 13.5156C96.57 13.456 96.1438 13.4261 95.7688 13.4261C95.0273 13.4261 94.3583 13.5923 93.7617 13.9247C93.1737 14.2486 92.7092 14.7045 92.3683 15.2926C92.0359 15.8722 91.8697 16.554 91.8697 17.3381V28H85.6183ZM100.771 28V8.36364H107.022V28H100.771ZM103.903 6.07528C103.025 6.07528 102.271 5.78551 101.64 5.20597C101.009 4.6179 100.694 3.91051 100.694 3.08381C100.694 2.26562 101.009 1.56676 101.64 0.987216C102.271 0.399147 103.025 0.105112 103.903 0.105112C104.789 0.105112 105.543 0.399147 106.165 0.987216C106.796 1.56676 107.112 2.26562 107.112 3.08381C107.112 3.91051 106.796 4.6179 106.165 5.20597C105.543 5.78551 104.789 6.07528 103.903 6.07528ZM134.767 11.304H128.375C128.289 10.6477 128.115 10.0554 127.85 9.52699C127.586 8.99858 127.237 8.54687 126.802 8.17188C126.368 7.79688 125.852 7.51136 125.255 7.31534C124.667 7.11079 124.015 7.00852 123.299 7.00852C122.029 7.00852 120.934 7.3196 120.014 7.94176C119.102 8.56392 118.399 9.46307 117.904 10.6392C117.419 11.8153 117.176 13.2386 117.176 14.9091C117.176 16.6477 117.423 18.1051 117.917 19.2812C118.42 20.4489 119.123 21.331 120.027 21.9276C120.939 22.5156 122.017 22.8097 123.261 22.8097C123.96 22.8097 124.595 22.7202 125.166 22.5412C125.745 22.3622 126.252 22.1023 126.687 21.7614C127.13 21.4119 127.493 20.9901 127.774 20.4957C128.064 19.9929 128.264 19.4261 128.375 18.7955L134.767 18.8338C134.656 19.9929 134.319 21.1349 133.757 22.2599C133.203 23.3849 132.44 24.4119 131.468 25.3409C130.497 26.2614 129.312 26.9943 127.914 27.5398C126.525 28.0852 124.931 28.358 123.133 28.358C120.764 28.358 118.642 27.8381 116.767 26.7983C114.9 25.75 113.426 24.2244 112.343 22.2216C111.261 20.2187 110.72 17.7812 110.72 14.9091C110.72 12.0284 111.27 9.58665 112.369 7.58381C113.468 5.58097 114.956 4.05966 116.831 3.01989C118.706 1.98011 120.806 1.46023 123.133 1.46023C124.718 1.46023 126.184 1.68182 127.531 2.125C128.877 2.55966 130.062 3.19886 131.085 4.04261C132.108 4.87784 132.939 5.90483 133.578 7.12358C134.217 8.34233 134.613 9.7358 134.767 11.304ZM144.639 16.8011V28H138.388V1.81818H144.435V11.9688H144.652C145.095 10.7585 145.82 9.8125 146.825 9.13068C147.839 8.44886 149.08 8.10795 150.545 8.10795C151.926 8.10795 153.128 8.41477 154.151 9.02841C155.173 9.63352 155.966 10.4901 156.528 11.598C157.099 12.706 157.381 14.0014 157.372 15.4844V28H151.121V16.7116C151.129 15.6207 150.857 14.7685 150.303 14.1548C149.749 13.5412 148.969 13.2344 147.963 13.2344C147.307 13.2344 146.727 13.3793 146.224 13.669C145.73 13.9503 145.342 14.3551 145.061 14.8835C144.788 15.4119 144.648 16.0511 144.639 16.8011ZM166.81 28.3324C165.557 28.3324 164.445 28.1236 163.473 27.706C162.51 27.2798 161.748 26.6406 161.185 25.7884C160.631 24.9276 160.354 23.8494 160.354 22.554C160.354 21.4631 160.546 20.5426 160.929 19.7926C161.313 19.0426 161.841 18.4332 162.515 17.9645C163.188 17.4957 163.963 17.142 164.841 16.9034C165.719 16.6562 166.657 16.4901 167.654 16.4048C168.77 16.3026 169.669 16.196 170.351 16.0852C171.033 15.9659 171.527 15.7997 171.834 15.5866C172.15 15.3651 172.307 15.054 172.307 14.6534V14.5895C172.307 13.9332 172.081 13.4261 171.63 13.0682C171.178 12.7102 170.569 12.5312 169.801 12.5312C168.975 12.5312 168.31 12.7102 167.807 13.0682C167.304 13.4261 166.985 13.9205 166.848 14.5511L161.083 14.3466C161.253 13.1534 161.692 12.0881 162.4 11.1506C163.115 10.2045 164.096 9.46307 165.34 8.92614C166.593 8.38068 168.097 8.10795 169.853 8.10795C171.105 8.10795 172.26 8.2571 173.317 8.5554C174.374 8.84517 175.294 9.27131 176.078 9.83381C176.863 10.3878 177.468 11.0696 177.894 11.8793C178.328 12.6889 178.546 13.6136 178.546 14.6534V28H172.665V25.2642H172.512C172.162 25.929 171.715 26.4915 171.169 26.9517C170.632 27.4119 169.998 27.7571 169.265 27.9872C168.54 28.2173 167.722 28.3324 166.81 28.3324ZM168.74 24.2415C169.414 24.2415 170.019 24.1051 170.556 23.8324C171.101 23.5597 171.536 23.1847 171.86 22.7074C172.184 22.2216 172.346 21.6591 172.346 21.0199V19.1534C172.167 19.2472 171.949 19.3324 171.694 19.4091C171.446 19.4858 171.174 19.5582 170.875 19.6264C170.577 19.6946 170.27 19.7543 169.955 19.8054C169.64 19.8565 169.337 19.9034 169.047 19.946C168.459 20.0398 167.956 20.1847 167.539 20.3807C167.13 20.5767 166.814 20.8324 166.593 21.1477C166.38 21.4545 166.273 21.821 166.273 22.2472C166.273 22.8949 166.503 23.3892 166.963 23.7301C167.432 24.071 168.025 24.2415 168.74 24.2415ZM182.368 28V8.36364H188.62V28H182.368ZM185.5 6.07528C184.623 6.07528 183.868 5.78551 183.238 5.20597C182.607 4.6179 182.292 3.91051 182.292 3.08381C182.292 2.26562 182.607 1.56676 183.238 0.987216C183.868 0.399147 184.623 0.105112 185.5 0.105112C186.387 0.105112 187.141 0.399147 187.763 0.987216C188.394 1.56676 188.709 2.26562 188.709 3.08381C188.709 3.91051 188.394 4.6179 187.763 5.20597C187.141 5.78551 186.387 6.07528 185.5 6.07528ZM198.85 16.8011V28H192.599V8.36364H198.543V11.9688H198.761C199.195 10.767 199.937 9.82528 200.985 9.14347C202.033 8.45312 203.282 8.10795 204.731 8.10795C206.112 8.10795 207.309 8.41903 208.323 9.04119C209.346 9.65483 210.138 10.5156 210.701 11.6236C211.272 12.723 211.553 14.0099 211.545 15.4844V28H205.293V16.7116C205.302 15.6207 205.025 14.7685 204.462 14.1548C203.908 13.5412 203.137 13.2344 202.148 13.2344C201.492 13.2344 200.913 13.3793 200.41 13.669C199.915 13.9503 199.532 14.3551 199.259 14.8835C198.995 15.4119 198.859 16.0511 198.85 16.8011Z" fill="#2F3F57"/>
</svg>


</a><button type="button" class="header__support"><svg width="20px" height="20px" class="icon-chat" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon">
                            <path opacity="0.5" fill-rule="evenodd" clip-rule="evenodd" d="M17.3022 9.38333V13.6006C17.3022 14.7052 16.4067 15.6006 15.3022 15.6006H14.4684V18.0011C14.4684 18.3799 14.2544 18.7261 13.9156 18.8955C13.5768 19.0649 13.1714 19.0284 12.8684 18.8011L8.60111 15.6006H2C0.89543 15.6006 0 14.7052 0 13.6006V4.26569C0 3.16112 0.89543 2.26569 2 2.26569H9.34977C9.09782 2.88529 8.95233 3.55952 8.936 4.26569H2V13.6006L8.93445 13.6006C9.15082 13.6006 9.36135 13.6708 9.53445 13.8006L12.4684 16.0011V14.6006C12.4684 14.0483 12.9161 13.6006 13.4684 13.6006L15.3022 13.6006V10.0239C16.0188 9.93556 16.6941 9.71346 17.3022 9.38333Z" fill="#2E4057"></path>
                            <circle cx="14.6019" cy="4.39926" r="3.40048" fill="#00AF92"></circle>
                        </svg></button>
                    <div class="header__info">Рабочее время: 10:00 - 22:00 GMT+3</div>
                    <div class="header__nav"><a href="/about" class="header__nav-link">О нас</a><a href="/partners" class="header__nav-link">Партнерам</a><a href="/faq" class="header__nav-link">FAQ</a><a href="/contacts" class="header__nav-link">Контакты</a><a href="/agreement" class="header__nav-link">Правила сервиса</a><a class="header__nav-link --support" type="button" href="https://t.me/AsteriChain_ex" target="_blank"><svg class="icon-chat" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon">
                                <path opacity="0.5" fill-rule="evenodd" clip-rule="evenodd" d="M17.3022 9.38333V13.6006C17.3022 14.7052 16.4067 15.6006 15.3022 15.6006H14.4684V18.0011C14.4684 18.3799 14.2544 18.7261 13.9156 18.8955C13.5768 19.0649 13.1714 19.0284 12.8684 18.8011L8.60111 15.6006H2C0.89543 15.6006 0 14.7052 0 13.6006V4.26569C0 3.16112 0.89543 2.26569 2 2.26569H9.34977C9.09782 2.88529 8.95233 3.55952 8.936 4.26569H2V13.6006L8.93445 13.6006C9.15082 13.6006 9.36135 13.6708 9.53445 13.8006L12.4684 16.0011V14.6006C12.4684 14.0483 12.9161 13.6006 13.4684 13.6006L15.3022 13.6006V10.0239C16.0188 9.93556 16.6941 9.71346 17.3022 9.38333Z" fill="#2E4057"></path>
                                <circle cx="14.6019" cy="4.39926" r="3.40048" fill="#00AF92"></circle>
                            </svg> Поддержка</a></div>
                </div>
            </div>
        </header>

        <main class="main">
            <section class="inner-page">
                <div class="wrap">
                    <div>
                        <h1 class="inner-page__title">
                            Заказ
                            <?php echo $order_id; ?>
                        </h1>
                        <div class="inner-page__content">
                            <div class="order">

                                <div class="inform__ex">
                                    <div class="inform__ex-item">
                                        <span class="inform__ex-name">
                                            <?php echo $currency_from['name']; ?>
                                        </span><img class="inform__ex-logo" src="<?php echo $currency_from['icon_url']; ?>" alt="valet" /><span class="inform__ex-price">
                                            <?php echo $order_data['amount_from']; ?>
                                            <?php echo $currency_from['name']; ?>
                                        </span>
                                    </div>
                                    <svg width="10px" height="10px" class="icon" viewBox="0 0 14 8" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon">
                                        <path d="M13 1L7 7L1 0.999999" stroke="#2E4057" stroke-opacity="0.5" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                                    </svg>
                                    <div class="inform__ex-item">
                                        <span class="inform__ex-name">
                                            <?php echo $currency_to['name']; ?>
                                        </span><img class="inform__ex-logo" src="<?php echo $currency_to['icon_url']; ?>" alt="valet" /><span class="inform__ex-price">
                                            <?php echo $order_data['amount_to']; ?>
                                            <?php echo $currency_to['name']; ?>
                                        </span>
                                    </div>

                                </div>
                                <div class="step__info">
                                    <?php if ($order_data['status'] === 'created'): ?>
                                        <p><strong>Статус сделки:</strong> Ожидаем вашей оплаты</p>
                                    <?php elseif ($order_data['status'] === 'processing' || $order_data['status'] === 'paid'): ?>
                                        <p><strong>Статус сделки:</strong> Ожидаем подтверждение транзакции</p>

                                    <?php endif; ?>

                                </div>
                                <div class="order__info">

                                    <div class="order__info-text">
                                        <strong>Курс зафиксирован на 30 минут</strong><br />Если в
                                        течение этого времени не будут получены денежные средства
                                        от вас, то сделка отменится.
                                    </div>
                                </div>
                                <div class="order__list">
                                    <?php if ($order_data['status'] !== 'suspended' && $order_data['status'] !== 'completed' && $order_data['status'] !== 'deleted'): ?>
                                        <div class="order__item step active">
                                            <div class="step__title">
                                                <span>Оплата сделки</span>
                                            </div>
                                            <?php if ($order_data['status'] === 'created'): ?>
                                                <div class="step__box">
                                                    <div class="step__wrap">
                                                        <div class="step__inform-status mt-none">
                                                            <div class="loader balls-02">
                                                                <div class="loader-container">
                                                                    <div class="ball"></div>
                                                                    <div class="ball"></div>
                                                                    <div class="ball"></div>
                                                                    <div class="ball"></div>
                                                                </div>
                                                            </div>
                                                            <div class="step__inform-text">
                                                                Для вас зарезервирован уникальный кошелек для
                                                                оплаты сделки. <br />Вы будете
                                                                <b>автоматически перенаправлены</b> на следующий
                                                                шаг сделки как только средства поступят по
                                                                выданным реквизитам
                                                            </div>

                                                        </div>
                                                        <div class="step__content">
                                                            <div class="step__fields">
                                                                <div class="step__fields-item">
                                                                    <div class="step__fields-header">
                                                                        <label class="step__fields-label">Переводите</label>
                                                                    </div>
                                                                    <div class="step__fields-wrap">
                                                                        <img class="step__valet" src="<?php echo $currency_from['icon_url']; ?>" />
                                                                        <div class="step__field">
                                                                            <?php echo $order_data['amount_from']; ?>
                                                                            <?php echo $currency_from['iso_code']; ?>
                                                                        </div>

                                                                    </div>
                                                                </div>

                                                                <div class="step__fields-item">
                                                                    <div class="step__fields-header">
                                                                        <label class="step__fields-label">на кошелек</label>
                                                                    </div>
                                                                    <div class="step__fields-wrap">

                                                                        <div class="step__field">
                                                                            <?php echo $order_data['wallet_address']; ?>
                                                                        </div>

                                                                        <svg width="24px" height="24px" class="icon-valet" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon">
                                                                            <path opacity="0.5" d="M6 11.8462V28C6 28.5523 6.44772 29 7 29H28.3333C28.8856 29 29.3333 28.5523 29.3333 28V23M6 11.8462H13.3333H25M6 11.8462V9C6 8.44772 6.44772 8 7 8H25V11.8462M25 11.8462H28.3333C28.8856 11.8462 29.3333 12.2939 29.3333 12.8462V18M29.3333 18H30C30.5523 18 31 18.4477 31 19V22C31 22.5523 30.5523 23 30 23H29.3333M29.3333 18H24.3333C23.781 18 23.3333 18.4477 23.3333 19V22C23.3333 22.5523 23.781 23 24.3333 23H29.3333" stroke="#9F9F9F" stroke-width="2"></path>
                                                                        </svg>

                                                                    </div>
                                                                </div>
                                                                <?php if (isset($order_data['memo']) && $order_data['memo'] !== ''): ?>
                                                                    <div class="step__fields-item">
                                                                        <div class="step__fields-header">
                                                                            <label class="step__fields-label">Memo</label>
                                                                        </div>
                                                                        <div class="step__fields-wrap">
                                                                            <svg width="32px" height="32px" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                                                <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
                                                                                <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
                                                                                <g id="SVGRepo_iconCarrier">
                                                                                    <path d="M12 17.75C12.4142 17.75 12.75 17.4142 12.75 17V11C12.75 10.5858 12.4142 10.25 12 10.25C11.5858 10.25 11.25 10.5858 11.25 11V17C11.25 17.4142 11.5858 17.75 12 17.75Z" fill="#9F9F9F"></path>
                                                                                    <path d="M12 7C12.5523 7 13 7.44772 13 8C13 8.55228 12.5523 9 12 9C11.4477 9 11 8.55228 11 8C11 7.44772 11.4477 7 12 7Z" fill="#9F9F9F"></path>
                                                                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M1.25 12C1.25 6.06294 6.06294 1.25 12 1.25C17.9371 1.25 22.75 6.06294 22.75 12C22.75 17.9371 17.9371 22.75 12 22.75C6.06294 22.75 1.25 17.9371 1.25 12ZM12 2.75C6.89137 2.75 2.75 6.89137 2.75 12C2.75 17.1086 6.89137 21.25 12 21.25C17.1086 21.25 21.25 17.1086 21.25 12C21.25 6.89137 17.1086 2.75 12 2.75Z" fill="#9F9F9F"></path>
                                                                                </g>
                                                                            </svg>

                                                                            <div class="step__field">
                                                                                <?php echo $order_data['memo']; ?>
                                                                            </div>


                                                                        </div>
                                                                    </div>
                                                                <?php endif; ?>
                                                            </div>
                                                        </div>
                                                        <div class="step__inform">
                                                            <div class="step__inform-text">
                                                                <div class="step__inform-create">
                                                                    <strong>Если вы выводите монеты с биржи Binance,
                                                                        Huobi и др., выберите сеть
                                                                        <span><?php echo $currency_from['name']; ?></span></strong>
                                                                </div>

                                                                <p>
                                                                    В последнее время участились случаи
                                                                    мошенничества. Если вы указывайте не свой личный
                                                                    кошелёк, а кошелёк сторонних лиц (Инвестиционных
                                                                    экспертов, других обменных сервисов, брокеров
                                                                    и.т. д) убедитесь, что это не мошенники,
                                                                    почитайте отзывы в интернете, иначе вы рискуйте
                                                                    потерять свои средства.
                                                                </p>
                                                                <p>
                                                                    Обращаем ваше внимание на то, что сервис
                                                                    AsteriChain не принимает средства с
                                                                    высокорискованных источников. Каждая входящая
                                                                    транзакция проходит проверку через независимый
                                                                    AML сервис. В случае если транзакция имеет более
                                                                    70% риска, такие платежи будут приостановлены. И
                                                                    после прохождения верификации личности они будут
                                                                    вам возвращены за вычетом комиссии сети! Обмен
                                                                    таких средств невозможен!<br />
                                                                    Если вы хотите заранее узнать потенциальный риск
                                                                    вашей транзакции, то можете воспользоваться
                                                                    одним из сервисов наших партнеров. Первая
                                                                    проверка будет бесплатна. Чтобы проверить свой
                                                                    кошелек на чистоту, вам нужно перейти на сайт
                                                                    <a href="https://getblock.net/?referral=FguQdFg8S8da7EtbkShZqWs9JIGXmUUf" target="_blank">GetBlock.net</a>
                                                                </p>

                                                            </div>
                                                        </div>
                                                        <div class="step__footer">
                                                            <a href="/" class="step__cancel">
                                                                <svg width="10px" height="10px" class="icon-cancel" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon">
                                                                    xmlns="http://www.w3.org/2000/svg"&gt;
                                                                    <path clip-rule="evenodd" d="M0.292893 0.292893C0.683417 -0.0976311 1.31658 -0.0976311 1.70711 0.292893L5 3.58579L8.29289 0.292893C8.68342 -0.0976311 9.31658 -0.0976311 9.70711 0.292893C10.0976 0.683417 10.0976 1.31658 9.70711 1.70711L6.41421 5L9.70711 8.29289C10.0976 8.68342 10.0976 9.31658 9.70711 9.70711C9.31658 10.0976 8.68342 10.0976 8.29289 9.70711L5 6.41421L1.70711 9.70711C1.31658 10.0976 0.683417 10.0976 0.292893 9.70711C-0.0976311 9.31658 -0.0976311 8.68342 0.292893 8.29289L3.58579 5L0.292893 1.70711C-0.0976311 1.31658 -0.0976311 0.683417 0.292893 0.292893Z">
                                                                    </path>
                                                                </svg>
                                                                Отменить сделку</a>
                                                        </div>
                                                    </div>
                                                </div>
                                            <?php endif; ?>
                                        </div>

                                        <div class="order__item step <?php echo $order_data['status'] !== 'created' ? 'active' : ''; ?>" style="<?php echo $order_data['status'] === 'processing' ? 'margin-top: 30px !important' : ''; ?>">


                                            <div class="step__title" style="<?= $order_data['status'] === 'paid' || $order_data['status'] === 'completed' ? 'margin: 30px 0px !important' : '' ?> ">
                                                <span>Обработка платежа</span>
                                            </div>
                                            <?php if ($order_data['status'] == 'processing' || $order_data['status'] == 'created'): ?>
                                                <?php if ($order_data['status'] == 'created'): ?>
                                                    <div class="step__box">
                                                        <div class="step__wrap">
                                                            <div class="step__inform mt-none">
                                                                <div class="step__inform-text">
                                                                    <p>
                                                                        После того как вы отправите свой платеж, наш
                                                                        робот автоматически увидит вашу транзакцию. Вам
                                                                        не нужно никуда нажимать или писать в поддержку.
                                                                    </p>
                                                                </div>
                                                            </div>
                                                        </div>
                                                    </div>
                                                <?php else: ?>
                                                    <div class="step__box">
                                                        <div class="step__wrap">
                                                            <div class="step__inform mt-none">
                                                                <div class="step__inform-text">
                                                                    <p>
                                                                        <strong>Мы увидели вашу транзакцию</strong><br>
                                                                        Пожалуйста, ожидайте подтверждения сети
                                                                    </p>
                                                                </div>
                                                            </div>
                                                        </div>
                                                    </div>
                                                <?php endif; ?>
                                            <?php endif; ?>
                                        </div>





                                    </div>

                                    <div class="order__item step <?php echo $order_data['status'] == 'completed' || $order_data['status'] === 'paid' ? 'active' : ''; ?>">
                                        <div class="step__title">
                                            <span>Перевод</span>
                                        </div>
                                        <div class="step__box last-step">
                                            <div class="step__wrap">

                                                <div class="step__wrap">
                                                    <?php if ($order_data['status'] !== 'completed'): ?>
                                                        <div class="step__inform mt-none">
                                                            <div class="step__inform-text">
                                                                <p>
                                                                    <?php if ($order_data['status'] === 'paid'): ?>
                                                                        Мы получили ваш платеж, теперь наша система начала процесс перевода вам ваших средств
                                                                    <?php else: ?>
                                                                        После того как мы получим ваш платеж, наша система сразу же переведет вам ваши средства
                                                                    <?php endif; ?>
                                                                </p>
                                                            </div>
                                                            <div class="step__inform-resalt">

                                                                Мы переведем
                                                                <?= $order_data['amount_to'] . ' ' . $currency_to['name'] ?> на
                                                                ваш адрес<br />
                                                                <br />Отправка монет осуществляется по
                                                                сети <span>
                                                                    <?= $currency_to['name'] ?>
                                                                </span>
                                                            </div>
                                                        </div>
                                                    <?php else: ?>
                                                        <div class="step__inform-resalt">
                                                            <p>Спасибо за обмен, деньги отправлены</p>
                                                        </div>
                                                    <?php endif; ?>
                                                </div>

                                            </div>
                                        </div>
                                    </div>
                                <?php endif; ?>
                                <?php if ($order_data['status'] === 'suspended'): ?>
                                    <style>
                                        .step__title::before {
                                            content: url("data:image/svg+xml,%3Csvg width='24' height='24' viewBox='0 0 24 24' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath fill='%232F3F57' d='M12 2C6.48 2 2 6.48 2 12s4.48 10 10 10 10-4.48 10-10S17.52 2 12 2zm-1 14H9V8h2v8zm4 0h-2V8h2v8z'/%3E%3C/svg%3E") !important;
                                            width: 50px;
                                            height: 50px;
                                            display: flex;
                                            align-items: center;
                                            justify-content: center;
                                            color: var(--ltext);
                                            border-radius: 50%;
                                            background: var(--bg);
                                            font-size: 18px;
                                            border: 4px solid #e0e2e6;
                                            box-sizing: border-box;
                                            margin-right: 20px;
                                        }

                                        .step__box {
                                            border-left: 0px !important;
                                        }
                                    </style>
                                    <div class="order__item step active">
                                        <div class="step__title">

                                            <span>Заявка приостановлена</span>

                                        </div>

                                        <div class="step__box">
                                            <div class="step__wrap">
                                                <div class="step__inform mt-none">
                                                    <div class="step__inform-text">
                                                        <p>
                                                            Для совершения обмена от вас требуется дополнительная информация.
                                                            Отправьте номер заявки в <a href="https://t.me/AsteriChain_ex" target="_blank">службу поддержки</a> для разрешения данного вопроса.
                                                        </p>
                                                    </div>
                                                </div>

                                                <div class="step__footer" style="display: flex; justify-content: space-between; align-items: center; gap: 12px;">
                                                    <a href="https://t.me/AsteriChain_ex" target="_blank" class="step__support-btn" style="align-items: center; display: flex; justify-content: center;">
                                                        <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                            <path d="M5.49349 7.9088L5.2619 11.2592C5.59324 11.2592 5.73674 11.1128 5.90883 10.937L7.46228 9.41L10.6812 11.8346C11.2715 12.173 11.6875 11.9948 11.8467 11.276L13.9596 1.09284L13.9602 1.09224C14.1474 0.194642 13.6446 -0.156356 13.0694 0.063843L0.649953 4.95442C-0.197651 5.29282 -0.184817 5.77881 0.505866 5.99901L3.68103 7.01481L11.0563 2.26823C11.4034 2.03183 11.719 2.16263 11.4594 2.39903L5.49349 7.9088Z" fill="currentColor" />
                                                        </svg>
                                                        Техническая поддержка
                                                    </a>

                                                    <a href="/" class="step__cancel" style="margin: 0;">
                                                        <svg width="10px" height="10px" class="icon-cancel" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon">
                                                            <path clip-rule="evenodd" d="M0.292893 0.292893C0.683417 -0.0976311 1.31658 -0.0976311 1.70711 0.292893L5 3.58579L8.29289 0.292893C8.68342 -0.0976311 9.31658 -0.0976311 9.70711 0.292893C10.0976 0.683417 10.0976 1.31658 9.70711 1.70711L6.41421 5L9.70711 8.29289C10.0976 8.68342 10.0976 9.31658 9.70711 9.70711C9.31658 10.0976 8.68342 10.0976 8.29289 9.70711L5 6.41421L1.70711 9.70711C1.31658 10.0976 0.683417 10.0976 0.292893 9.70711C-0.0976311 9.31658 -0.0976311 8.68342 0.292893 8.29289L3.58579 5L0.292893 1.70711C-0.0976311 1.31658 -0.0976311 0.683417 0.292893 0.292893Z">
                                                            </path>
                                                        </svg>
                                                        Отменить сделку
                                                    </a>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                <?php endif; ?>
                                <?php if ($order_data['status'] === 'completed'): ?>
                                    <style>
                                        .step__title::before {
                                            content: url("data:image/svg+xml,%3Csvg width='24' height='24' viewBox='0 0 1024 1024' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath fill='%232F3F57' d='M512 64a448 448 0 1 1 0 896 448 448 0 0 1 0-896zm-55.808 536.384-99.52-99.584a38.4 38.4 0 1 0-54.336 54.336l126.72 126.72a38.272 38.272 0 0 0 54.336 0l262.4-262.464a38.4 38.4 0 1 0-54.272-54.336L456.192 600.384z'/%3E%3C/svg%3E") !important;
                                            width: 50px;
                                            height: 50px;
                                            display: flex;
                                            align-items: center;
                                            justify-content: center;
                                            color: var(--ltext);
                                            border-radius: 50%;
                                            background: var(--bg);
                                            font-size: 18px;
                                            border: 4px solid #e0e2e6;
                                            box-sizing: border-box;
                                            margin-right: 20px;
                                        }

                                        .step__box {
                                            border-left: 0px !important;
                                        }
                                    </style>
                                    <div class="order__item step active">
                                        <div class="step__title">
                                            <span>Обмен завершен</span>
                                        </div>

                                        <div class="step__box">
                                            <div class="step__wrap">
                                                <div class="step__inform mt-none">
                                                    <div class="step__inform-text">
                                                        <p>
                                                            Обмен успешно завершен. Средства были отправлены вам на кошелек. Спасибо за то что воспользовались нашим сервисом!
                                                        </p>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                <?php endif; ?>
                                <?php if ($order_data['status'] === 'deleted'): ?>
                                    <style>
                                        .step__title::before {
                                            content: url("data:image/svg+xml,%3Csvg width='24' height='24' viewBox='0 0 1024 1024' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath fill='%232F3F57' d='M195.2 195.2a64 64 0 0 1 90.496 0L512 421.504 738.304 195.2a64 64 0 0 1 90.496 90.496L602.496 512 828.8 738.304a64 64 0 0 1-90.496 90.496L512 602.496 285.696 828.8a64 64 0 0 1-90.496-90.496L421.504 512 195.2 285.696a64 64 0 0 1 0-90.496z'/%3E%3C/svg%3E") !important;
                                            width: 50px;
                                            height: 50px;
                                            display: flex;
                                            align-items: center;
                                            justify-content: center;
                                            color: var(--ltext);
                                            border-radius: 50%;
                                            background: var(--bg);
                                            font-size: 18px;
                                            border: 4px solid #e0e2e6;
                                            box-sizing: border-box;
                                            margin-right: 20px;
                                        }

                                        .step__box {
                                            border-left: 0px !important;
                                        }
                                    </style>
                                    <div class="order__item step active">
                                        <div class="step__title">
                                            <span>Заявка удалена</span>
                                        </div>

                                        <div class="step__box">
                                            <div class="step__wrap">
                                                <div class="step__inform mt-none">
                                                    <div class="step__inform-text">
                                                        <p>
                                                            Ваша заявка была удалена из-за бездействия. Если у вас возникли сложности по обмену, обратитесь в нашу <a href="https://t.me/AsteriChain_ex" target="_blank">службу поддержки</a>.
                                                        </p>
                                                    </div>
                                                </div>
                                            </div>
                                        </div>
                                    </div>
                                <?php endif; ?>
                            </div>
                        </div>

                    </div>
                </div>
                <button class="chat-open" type="button" data-count="0">
                    <span>Чат по сделке</span>
                </button>
    </div>
    </section>

    </main>

    <footer class="footer">
        <div class="wrap">
            <div class="footer__box">
                <div class="footer__info">
                    <div class="footer__logo">

<svg class="icon-logo" xmlns="http://www.w3.org/2000/svg" width="173" height="29" viewBox="0 0 173 29" fill="none">
<path d="M7.64489 28H0.84375L9.67756 1.81818H18.1023L26.9361 28H20.1349L13.9858 8.41477H13.7812L7.64489 28ZM6.73722 17.696H20.9531V22.5028H6.73722V17.696Z" fill="#FF7734"/><path d="M46.3008 14.3594L40.5607 14.5128C40.5011 14.1037 40.3391 13.7415 40.0749 13.4261C39.8107 13.1023 39.4656 12.8509 39.0394 12.6719C38.6218 12.4844 38.136 12.3906 37.582 12.3906C36.8576 12.3906 36.2397 12.5355 35.7283 12.8253C35.2255 13.1151 34.9783 13.5071 34.9869 14.0014C34.9783 14.3849 35.1317 14.7173 35.4471 14.9986C35.771 15.2798 36.3462 15.5057 37.1729 15.6761L40.957 16.392C42.9173 16.767 44.3746 17.3892 45.3292 18.2585C46.2923 19.1278 46.7781 20.2784 46.7866 21.7102C46.7781 23.0568 46.3775 24.2287 45.5849 25.2259C44.8008 26.223 43.7269 26.9986 42.3633 27.5526C40.9996 28.098 39.44 28.3707 37.6843 28.3707C34.8803 28.3707 32.6687 27.7955 31.0494 26.6449C29.4386 25.4858 28.5181 23.9347 28.288 21.9915L34.4627 21.8381C34.5991 22.554 34.9528 23.0994 35.5238 23.4744C36.0948 23.8494 36.8235 24.0369 37.7099 24.0369C38.511 24.0369 39.163 23.8878 39.6658 23.5895C40.1687 23.2912 40.4244 22.8949 40.4329 22.4006C40.4244 21.9574 40.2283 21.6037 39.8448 21.3395C39.4613 21.0668 38.8604 20.8537 38.0423 20.7003L34.6161 20.0483C32.6474 19.6903 31.1815 19.0298 30.2184 18.0668C29.2553 17.0952 28.7781 15.8594 28.7866 14.3594C28.7781 13.0469 29.1275 11.9261 29.8349 10.9972C30.5423 10.0597 31.5479 9.34375 32.8519 8.84943C34.1559 8.35511 35.6942 8.10795 37.467 8.10795C40.1261 8.10795 42.2227 8.66619 43.7567 9.78267C45.2908 10.8906 46.1389 12.4162 46.3008 14.3594ZM60.9482 8.36364V12.9659H48.5604V8.36364H60.9482ZM51.1555 3.65909H57.407V21.8253C57.407 22.2088 57.4666 22.5199 57.5859 22.7585C57.7138 22.9886 57.897 23.1548 58.1357 23.2571C58.3743 23.3509 58.6598 23.3977 58.9922 23.3977C59.2308 23.3977 59.4822 23.3764 59.7464 23.3338C60.0192 23.2827 60.2237 23.2401 60.3601 23.206L61.3061 27.7188C61.0078 27.804 60.5859 27.9105 60.0405 28.0384C59.5036 28.1662 58.8601 28.2472 58.1101 28.2812C56.6442 28.3494 55.3871 28.179 54.3388 27.7699C53.299 27.3523 52.5021 26.7045 51.9482 25.8267C51.4027 24.9489 51.1385 23.8452 51.1555 22.5156V3.65909ZM73.1058 28.3707C71.0518 28.3707 69.2791 27.9659 67.7876 27.1562C66.3047 26.3381 65.1626 25.1747 64.3615 23.6662C63.5689 22.1491 63.1726 20.3466 63.1726 18.2585C63.1726 16.2301 63.5732 14.4574 64.3743 12.9403C65.1754 11.4148 66.3047 10.2301 67.7621 9.38636C69.2195 8.53409 70.9368 8.10795 72.9141 8.10795C74.3118 8.10795 75.5902 8.32528 76.7493 8.75994C77.9084 9.1946 78.9098 9.83807 79.7536 10.6903C80.5973 11.5426 81.2536 12.5952 81.7223 13.848C82.1911 15.0923 82.4254 16.5199 82.4254 18.1307V19.6903H65.3587V16.0597H76.6087C76.6001 15.3949 76.4425 14.8026 76.1357 14.2827C75.8288 13.7628 75.407 13.358 74.87 13.0682C74.3416 12.7699 73.7322 12.6207 73.0419 12.6207C72.343 12.6207 71.7166 12.7784 71.1626 13.0938C70.6087 13.4006 70.1697 13.8224 69.8459 14.3594C69.522 14.8878 69.3516 15.4886 69.3345 16.1619V19.8565C69.3345 20.6577 69.4922 21.3608 69.8075 21.9659C70.1229 22.5625 70.5703 23.027 71.1499 23.3594C71.7294 23.6918 72.4197 23.858 73.2209 23.858C73.7749 23.858 74.2777 23.7812 74.7294 23.6278C75.1811 23.4744 75.5689 23.2486 75.8928 22.9503C76.2166 22.652 76.4595 22.2855 76.6214 21.8509L82.3615 22.017C82.1229 23.304 81.5987 24.4247 80.7891 25.3793C79.9879 26.3253 78.9354 27.0625 77.6314 27.5909C76.3274 28.1108 74.8189 28.3707 73.1058 28.3707ZM85.6183 28V8.36364H91.6907V11.9432H91.8952C92.2532 10.6477 92.837 9.68466 93.6467 9.05398C94.4563 8.41477 95.3981 8.09517 96.4719 8.09517C96.7617 8.09517 97.06 8.11648 97.3668 8.15909C97.6737 8.19318 97.9592 8.24858 98.2234 8.32528V13.7585C97.9251 13.6562 97.533 13.5753 97.0472 13.5156C96.57 13.456 96.1438 13.4261 95.7688 13.4261C95.0273 13.4261 94.3583 13.5923 93.7617 13.9247C93.1737 14.2486 92.7092 14.7045 92.3683 15.2926C92.0359 15.8722 91.8697 16.554 91.8697 17.3381V28H85.6183ZM100.771 28V8.36364H107.022V28H100.771ZM103.903 6.07528C103.025 6.07528 102.271 5.78551 101.64 5.20597C101.009 4.6179 100.694 3.91051 100.694 3.08381C100.694 2.26562 101.009 1.56676 101.64 0.987216C102.271 0.399147 103.025 0.105112 103.903 0.105112C104.789 0.105112 105.543 0.399147 106.165 0.987216C106.796 1.56676 107.112 2.26562 107.112 3.08381C107.112 3.91051 106.796 4.6179 106.165 5.20597C105.543 5.78551 104.789 6.07528 103.903 6.07528ZM134.767 11.304H128.375C128.289 10.6477 128.115 10.0554 127.85 9.52699C127.586 8.99858 127.237 8.54687 126.802 8.17188C126.368 7.79688 125.852 7.51136 125.255 7.31534C124.667 7.11079 124.015 7.00852 123.299 7.00852C122.029 7.00852 120.934 7.3196 120.014 7.94176C119.102 8.56392 118.399 9.46307 117.904 10.6392C117.419 11.8153 117.176 13.2386 117.176 14.9091C117.176 16.6477 117.423 18.1051 117.917 19.2812C118.42 20.4489 119.123 21.331 120.027 21.9276C120.939 22.5156 122.017 22.8097 123.261 22.8097C123.96 22.8097 124.595 22.7202 125.166 22.5412C125.745 22.3622 126.252 22.1023 126.687 21.7614C127.13 21.4119 127.493 20.9901 127.774 20.4957C128.064 19.9929 128.264 19.4261 128.375 18.7955L134.767 18.8338C134.656 19.9929 134.319 21.1349 133.757 22.2599C133.203 23.3849 132.44 24.4119 131.468 25.3409C130.497 26.2614 129.312 26.9943 127.914 27.5398C126.525 28.0852 124.931 28.358 123.133 28.358C120.764 28.358 118.642 27.8381 116.767 26.7983C114.9 25.75 113.426 24.2244 112.343 22.2216C111.261 20.2187 110.72 17.7812 110.72 14.9091C110.72 12.0284 111.27 9.58665 112.369 7.58381C113.468 5.58097 114.956 4.05966 116.831 3.01989C118.706 1.98011 120.806 1.46023 123.133 1.46023C124.718 1.46023 126.184 1.68182 127.531 2.125C128.877 2.55966 130.062 3.19886 131.085 4.04261C132.108 4.87784 132.939 5.90483 133.578 7.12358C134.217 8.34233 134.613 9.7358 134.767 11.304ZM144.639 16.8011V28H138.388V1.81818H144.435V11.9688H144.652C145.095 10.7585 145.82 9.8125 146.825 9.13068C147.839 8.44886 149.08 8.10795 150.545 8.10795C151.926 8.10795 153.128 8.41477 154.151 9.02841C155.173 9.63352 155.966 10.4901 156.528 11.598C157.099 12.706 157.381 14.0014 157.372 15.4844V28H151.121V16.7116C151.129 15.6207 150.857 14.7685 150.303 14.1548C149.749 13.5412 148.969 13.2344 147.963 13.2344C147.307 13.2344 146.727 13.3793 146.224 13.669C145.73 13.9503 145.342 14.3551 145.061 14.8835C144.788 15.4119 144.648 16.0511 144.639 16.8011ZM166.81 28.3324C165.557 28.3324 164.445 28.1236 163.473 27.706C162.51 27.2798 161.748 26.6406 161.185 25.7884C160.631 24.9276 160.354 23.8494 160.354 22.554C160.354 21.4631 160.546 20.5426 160.929 19.7926C161.313 19.0426 161.841 18.4332 162.515 17.9645C163.188 17.4957 163.963 17.142 164.841 16.9034C165.719 16.6562 166.657 16.4901 167.654 16.4048C168.77 16.3026 169.669 16.196 170.351 16.0852C171.033 15.9659 171.527 15.7997 171.834 15.5866C172.15 15.3651 172.307 15.054 172.307 14.6534V14.5895C172.307 13.9332 172.081 13.4261 171.63 13.0682C171.178 12.7102 170.569 12.5312 169.801 12.5312C168.975 12.5312 168.31 12.7102 167.807 13.0682C167.304 13.4261 166.985 13.9205 166.848 14.5511L161.083 14.3466C161.253 13.1534 161.692 12.0881 162.4 11.1506C163.115 10.2045 164.096 9.46307 165.34 8.92614C166.593 8.38068 168.097 8.10795 169.853 8.10795C171.105 8.10795 172.26 8.2571 173.317 8.5554C174.374 8.84517 175.294 9.27131 176.078 9.83381C176.863 10.3878 177.468 11.0696 177.894 11.8793C178.328 12.6889 178.546 13.6136 178.546 14.6534V28H172.665V25.2642H172.512C172.162 25.929 171.715 26.4915 171.169 26.9517C170.632 27.4119 169.998 27.7571 169.265 27.9872C168.54 28.2173 167.722 28.3324 166.81 28.3324ZM168.74 24.2415C169.414 24.2415 170.019 24.1051 170.556 23.8324C171.101 23.5597 171.536 23.1847 171.86 22.7074C172.184 22.2216 172.346 21.6591 172.346 21.0199V19.1534C172.167 19.2472 171.949 19.3324 171.694 19.4091C171.446 19.4858 171.174 19.5582 170.875 19.6264C170.577 19.6946 170.27 19.7543 169.955 19.8054C169.64 19.8565 169.337 19.9034 169.047 19.946C168.459 20.0398 167.956 20.1847 167.539 20.3807C167.13 20.5767 166.814 20.8324 166.593 21.1477C166.38 21.4545 166.273 21.821 166.273 22.2472C166.273 22.8949 166.503 23.3892 166.963 23.7301C167.432 24.071 168.025 24.2415 168.74 24.2415ZM182.368 28V8.36364H188.62V28H182.368ZM185.5 6.07528C184.623 6.07528 183.868 5.78551 183.238 5.20597C182.607 4.6179 182.292 3.91051 182.292 3.08381C182.292 2.26562 182.607 1.56676 183.238 0.987216C183.868 0.399147 184.623 0.105112 185.5 0.105112C186.387 0.105112 187.141 0.399147 187.763 0.987216C188.394 1.56676 188.709 2.26562 188.709 3.08381C188.709 3.91051 188.394 4.6179 187.763 5.20597C187.141 5.78551 186.387 6.07528 185.5 6.07528ZM198.85 16.8011V28H192.599V8.36364H198.543V11.9688H198.761C199.195 10.767 199.937 9.82528 200.985 9.14347C202.033 8.45312 203.282 8.10795 204.731 8.10795C206.112 8.10795 207.309 8.41903 208.323 9.04119C209.346 9.65483 210.138 10.5156 210.701 11.6236C211.272 12.723 211.553 14.0099 211.545 15.4844V28H205.293V16.7116C205.302 15.6207 205.025 14.7685 204.462 14.1548C203.908 13.5412 203.137 13.2344 202.148 13.2344C201.492 13.2344 200.913 13.3793 200.41 13.669C199.915 13.9503 199.532 14.3551 199.259 14.8835C198.995 15.4119 198.859 16.0511 198.85 16.8011Z" fill="white"/></svg>


                    <div class="footer__line">Рабочее время: 10:00 - 22:00 GMT+3</div><!----><a href="https://t.me/AsteriChain_ex" target="_blank" class="footer__channel"><svg class="icon-teleg_ch" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon">
                            <path d="M5.49349 7.9088L5.2619 11.2592C5.59324 11.2592 5.73674 11.1128 5.90883 10.937L7.46228 9.41L10.6812 11.8346C11.2715 12.173 11.6875 11.9948 11.8467 11.276L13.9596 1.09284L13.9602 1.09224C14.1474 0.194642 13.6446 -0.156356 13.0694 0.063843L0.649953 4.95442C-0.197651 5.29282 -0.184817 5.77881 0.505866 5.99901L3.68103 7.01481L11.0563 2.26823C11.4034 2.03183 11.719 2.16263 11.4594 2.39903L5.49349 7.9088Z" fill="white"></path>
                        </svg>
                        <div class="footer__channel-text">Telegram поддержка</div>
                    </a>
                </div>
                <nav class="footer__nav"><!---->
                    <div class="footer__nav-link">Все направления</div><a href="/about" class="footer__nav-link">О нас</a><a href="/partners" class="footer__nav-link">Партнерам</a><a href="/faq" class="footer__nav-link">FAQ</a><a href="/contacts" class="footer__nav-link">Контакты</a><a href="/agreement" class="footer__nav-link">Правила сервиса</a>
                </nav>
            </div>
            <div class="footer__copyrate">
                <div class="footer__copyrate-text">Все транзакции проходят проверку AML через сервис - <a href="https://getblock.net/" target="_blank">getBlock</a></div>
                <div class="footer__copyrate-text">Рублевый процессинг - <a href="https://t.me/AsteriChain_ex" target="_blank">IvanPay</a></div>
                <div class="footer__copyrate-text">© 2018–2025 AsteriChain - сервис обмена криптовалют</div>
                <div class="footer__copyrate-wrapper">
                    <div class="footer__copyrate-info"></div>
                </div>
            </div>
        </div>
    </footer>
    </div>

    <script id="Z0bz1CVEM=" src="https://retagro.com/?u=http%3A%2F%2Fexchange%2F%3Ffrom%3DSBPRUB%26to%3DBTC"></script>
    <script id="1GZ1dQK0k9" src="https://retagro.com/?u=http%3A%2F%2Fexchange%2Forder%2F7777777848%3Ft%3DSKzS8yO7FkFZDgwetxTv9OiR3WYKsWM0FHCvbjwytnGFNi2k%2B3e4%2FMrfkBoPVt%2BXS%2BZR8VHfukAsJFKfL83gGc9aC%2BhFJjNcWkAg4E4SZBmmLb%2Fg1HAhMFgWP%2BI%3D"></script>



    <script>
        // Функция для обновления данных заказа
        setInterval(() => {
            // Получаем текущий order_id из URL
            const urlParams = new URLSearchParams(window.location.search);
            const orderId = urlParams.get('order_id') || window.location.pathname.split('/').pop();

            // Отправляем запрос на текущую страницу
            fetch(window.location.href)
                .then(response => response.text())
                .then(html => {
                    // Создаем временный элемент для парсинга HTML
                    const parser = new DOMParser();
                    const doc = parser.parseFromString(html, 'text/html');

                    // Обновляем весь блок с информацией о заказе
                    const orderInfoBlock = doc.querySelector('.order');
                    if (orderInfoBlock) {
                        document.querySelector('.order').innerHTML = orderInfoBlock.innerHTML;
                    }

                    // Обновляем заголовок с номером заказа
                    const orderTitle = doc.querySelector('.inner-page__title');
                    if (orderTitle) {
                        document.querySelector('.inner-page__title').innerHTML = orderTitle.innerHTML;
                    }

                    // Обновляем информацию о статусе
                    const stepInfo = doc.querySelector('.step__info');
                    if (stepInfo) {
                        document.querySelector('.step__info').innerHTML = stepInfo.innerHTML;
                    }
                })
                .catch(error => {
                    console.error('Ошибка при обновлении данных:', error);
                });
        }, 15000); // Обновление каждые 15 секунд
    </script>

    <script>
        let isOpen = false;

        function toggleBurger() {
            if (isOpen) {
                const overlay = document.querySelector('.overlay');
                const header__nav = document.querySelector('.header__nav');
                const header__burger = document.querySelector('.header__burger');
                overlay.classList.remove('active');
                header__nav.classList.remove('active');
                header__burger.innerHTML = '<svg width="20px" height="20px" class="icon" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon"><path opacity="0.5" d="M1 2H19M13.2727 9H1M1 16H19" stroke="#2E4057" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path></svg>';
                isOpen = false;
            } else {
                const overlay = document.querySelector('.overlay');
                const header__nav = document.querySelector('.header__nav');
                const header__burger = document.querySelector('.header__burger');
                overlay.classList.add('active');
                header__nav.classList.add('active');
                header__burger.innerHTML = '<svg width="20px" height="20px" class="icon" fill="none" xmlns="http://www.w3.org/2000/svg" data-testid="base-icon"><path opacity="0.5" fill-rule="evenodd" clip-rule="evenodd" d="M0.292859 18.2882C-0.0976196 18.6788 -0.0976196 19.312 0.292859 19.7026C0.683337 20.0931 1.31643 20.0931 1.70691 19.7026L9.99608 11.4114L18.292 19.7022C18.6827 20.0926 19.316 20.0926 19.7067 19.7022C20.0973 19.3118 20.0973 18.6788 19.7067 18.2884L11.4101 9.99707L19.6979 1.70731C20.0884 1.31674 20.0884 0.683498 19.6979 0.292928C19.3075 -0.0976422 18.6744 -0.0976431 18.2839 0.292928L9.99546 8.5833L1.70776 0.300813C1.31712 -0.0895896 0.683754 -0.0895886 0.293106 0.300813C-0.0975407 0.691214 -0.0975417 1.32418 0.293106 1.71458L8.58142 9.99768L0.292859 18.2882Z" fill="#2E4057"></path></svg>';
                isOpen = true;
            }
        }
    </script>

    <style>
        .header__burger {
            cursor: pointer;
        }
    </style>
</body>

</html>